Revit 2027 API
RevitLinkGraphicsSettings.GetDisciplineType Method
 The discipline type of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkVisibility GetDisciplineType()
Public Function GetDisciplineType As LinkVisibility
public:
LinkVisibility GetDisciplineType()
member GetDisciplineType : unit -> LinkVisibility
Return Value
LinkVisibility
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace